* Request <2018-04-05 Thu> from gigio.
  :LOGBOOK:
  CLOCK: [2018-04-06 Fri 15:00]--[2018-04-06 Fri 16:15] =>  1:15
  CLOCK: [2018-04-05 Thu 15:00]--[2018-04-05 Thu 17:10] =>  2:10
  :END:

He'd like to try and tell which isoform of a few genes was being used in the C1 mouse limb data.

ENSMUSG00000020167
ENSMUSG00000032228
ENSMUSG00000063659
ENSMUSG00000030189

['ENSMUSG00000020167','ENSMUSG00000032228','ENSMUSG00000063659','ENSMUSG00000030189']

Wrote [[file:generate_combined_transcript_C1.py]] to generate his output file

* Request <2018-05-07 Mon> from Brian compare what's been submitted to what should be submitted.
[[file:compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods][compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods]] sheet should_be_submitted

Message-ID: <DM6PR03MB3515995D17F635F25D20E31FA0850@DM6PR03MB3515.namprd03.prod.outlook.com>

#+BEGIN_SRC python :results output
  import sys
  import pandas
  from pandasodf import ODFReader
  from htsworkflow.submission.encoded import ENCODED
  from requests.exceptions import  HTTPError

  def main():
      book = ODFReader('compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods')
      print(book.sheet_names)
      paper = book.parse('cells_in_paper')
      submitted = book.parse('should_be_submitted')

      server = ENCODED('www.encodeproject.org')

      paper_cells = set(paper['all_cells_in_manuscript'])
      submitted_cells = set(submitted['submitted_library_ids'])
      for cell in sorted(paper_cells.difference(submitted_cells)):
          alias = 'barbara-wold:{}'.format(cell)
          try:
             body = server.get_json(alias)
              state = ''
          except HTTPError as e:
              state = 'Not found'
          print('{},{}'.format(cell,state))

      #print('cells just in submitted set', ','.join(sorted(submitted_cells.difference(paper_cells))))

  if __name__ == '__main__':
      main()
#+END_SRC

#+RESULTS:
#+begin_example
['cells_in_paper', 'should_be_submitted']
17329_C4,Not found
17330_D12,Not found
17330_D9,Not found
17331_E8,Not found
17332_F1,Not found
17332_F3,Not found
17332_F6,Not found
17332_F7,Not found
17332_F8,Not found
17333_G2,Not found
17333_G6,Not found
17333_G9,Not found
17334_H1,Not found
17334_H3,Not found
17334_H7,Not found
18042_A12,Not found
18042_A4,Not found
18044_C11,Not found
18045_D11,Not found
18045_D2,Not found
18045_D6,Not found
18046_E9,Not found
18048_G10,Not found
18049_H5,Not found
18087_F9,Not found
18251_A2,Not found
18253_C5,Not found
18254_D11,Not found
18254_D5,Not found
18256_F5,Not found
18256_F8,Not found
18256_F9,Not found
18257_G5,Not found
18259_B8,Not found
18260_C11,Not found
18260_C2,Not found
18260_C6,Not found
18261_D3,Not found
18261_D5,Not found
18263_A12,Not found
18263_A4,Not found
18264_B3,Not found
18264_B4,Not found
18264_B8,Not found
18265_C10,Not found
18265_C4,Not found
18266_D1,Not found
18266_D6,Not found
18267_E10,Not found
18267_E3,Not found
18267_E4,Not found
18267_E6,Not found
18268_F1,Not found
18268_F12,Not found
18268_F3,Not found
18268_F7,Not found
18268_F8,Not found
18311_A4,Not found
18312_B4,Not found
18312_B5,Not found
18313_C1,Not found
18313_C10,Not found
18313_C11,Not found
18313_C12,Not found
18313_C5,Not found
18313_C7,Not found
18313_C8,Not found
18314_D2,Not found
18314_D3,Not found
18314_D4,Not found
18314_D7,Not found
18315_E12,Not found
18315_E2,Not found
18315_E4,Not found
18315_E6,Not found
18316_F1,Not found
18316_F10,Not found
18316_F11,Not found
18316_F5,Not found
18317_G3,Not found
18317_G4,Not found
18317_G7,Not found
18317_G8,Not found
18317_G9,Not found
#+end_example

Those were the libraries that weren't submitted...

However, Idan would prefer the whole thing to be replaced with the
newer pooled model.

Working on preparing submission, started altering
prepare_submission_20180430.py to support reading different files.

#+NAME run prepare submission
#+BEGIN_SRC bash
PYTHONPATH=/woldlab/loxcyc/home/diane/proj/htsworkflow:/woldlab/loxcyc/home/diane/src/pandasodf python3 \
  prepare_submission_20180430.py \
     --name submission-20180619 \
     --sheet cells_in_paper \
     --header 0 \
     compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods
#+END_SRC

Unfortunately the mirror of htsworkflow is broken on felcat.


** Did we submit what we're supposed to?

| C1_e10.5_mouse_limb_run1_June6_2016            |  87 |
| C1_e10.5_mouse_limb_run2_June20_2016           |  56 |
| C1_e10.5_mouse_limb_run3_Dec5_2016             |  32 |
| C1_mouse_e11.0_limb_mesenchyme_mm10_run5       |  58 |
| C1_mouse_e11.5_limb_mesenchyme_mm10_run6       |  80 |
| C1_mouse_e12.5_limb_mesenchyme_mm10_run7       |  76 |
| C1_mouse_e13.5_limb_mesenchyme_mm10_run4       |  71 |
| C1_mouse_e13.5_limb_mesenchyme_mm10_run8       |  64 |
| C1_mouse_e10.5_forelimb_run15_January13AM_2018 |  18 |
| C1_mouse_e11.0_forelimb_run16_January13PM_2018 |  14 |
| C1_mouse_e11.5_forelimb_run10_December11_2017  |  77 |
| C1_mouse_e12.0_forelimb_run11_December12_2017  |  77 |
| C1_mouse_e13.0_forelimb_run12_December13_2017  |  72 |
| C1_mouse_e14.0_forelimb_run13_December14_2017  |  53 |
| C1_mouse_e14.5_forelimb_run17_January16_2018   |  27 |
| C1_mouse_e15.5_forelimb_run14_December15_2017  |  58 |
|                                                | 920 |
#+TBLFM: @17$2=vsum(@1$2..@16$2)

Paper sheet says 920 sum of aliases in tsvs sumbs to 920.
whew

** Barbara wants all the fastqs to be the same length. 50.

Built a set of submission metadata with "everything" included

#+BEGIN_SRC python :results output
import pandas
from pprint import pprint
df = pandas.read_csv('submission-20180928-flowcell-details.tsv', sep='\t')
pprint(set(df[df['read_length'] == 101]['experiment']))

#+END_SRC

#+RESULTS:
: {'C1_e10.5_mouse_limb_run3_Dec5_2016',
:  'C1_mouse_e13.5_limb_mesenchyme_mm10_run4',
:  'C1_mouse_e11.0_limb_mesenchyme_mm10_run5',
:  'C1_mouse_e11.5_limb_mesenchyme_mm10_run6',
:  'C1_mouse_e14.0_forelimb_run13_December14_2017'}

Those are the ones with 100 bp

